Revit 2026 API
ServerPath Class
 This class represents a path to a Revit Server location, rather than a location on disk or a network drive.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ModelPath
 Autodesk.Revit.DB.ServerPath
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ServerPath : ModelPath
Public Class ServerPath
	Inherits ModelPath
public ref class ServerPath : public ModelPath
type ServerPath =
    class
        inherit ModelPath
    end
The ServerPath type exposes the following members.
Constructors
Name | Description
ServerPath |  Constructs a ServerPath
Top
Properties
Name | Description
CentralServerPath |  The path to the location of the central Revit server or cloud.
(Inherited from ModelPath)
CloudPath |  Whether this path represents a path on an Autodesk server such as BIM360.
(Inherited from ModelPath)
Empty |  Whether this path is empty
(Inherited from ModelPath)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ModelPath)
Region |  The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
(Inherited from ModelPath)
ServerPath |  Whether this path is a server path (as opposed to a file path or cloud path)
(Inherited from ModelPath)
Top
Methods
Name | Description
Compare |  Compares this ModelPath with another
(Inherited from ModelPath)
Dispose
(Inherited from ModelPath)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModelGUID |  A GUID identifying the Revit cloud model.
(Inherited from ModelPath)
GetProjectGUID |  A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
(Inherited from ModelPath)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
ServerPaths must refer to Revit models.
ServerPaths are relative to the central server location, and are of the form "RSN://{HostNodeName}/{model_path}".
The {model_path} portion is a relative path to a Revit model. For example, the following are valid server paths:
RSN://EXS/hospital.rvt
RSN://EXS.autodesk.com/Old Files/hotel2.rvt
RSN://EXS.autodesk.com/Old Files/Last Week/Tuesday\hotel2.rvt
 The following would not be valid server paths:
//EXS/Old Files/.rvt
EXS/hospital
See Also
Reference
Autodesk.Revit.DB Namespace